#  Debugging – რას ნიშნავს

# Debugging ეწოდება პროცესს, რომლის მიზანიც არის კოდში არსებული შეცდომების (error-ების) 
# აღმოჩენა და გასწორება.

# როდესაც პროგრამა არ მუშაობს სწორად ან გვიბრუნებს შეცდომას, ჩვენ ვიწყებთ დებაგინგს,























#  Python-ში გავრცელებული შეცდომები:

# 1. SyntaxError – კოდის წერისას სინტაქსის შეცდომა (მაგ: დახურული ბრჭყალები აკლია)
# 2. NameError – ცვლადის ან ფუნქციის სახელი არ არის ცნობილი ან შეცდომითაა დაწერილი
# 3. TypeError – როდესაც არასწორი ტიპის მონაცემს ვიყენებთ (მაგ: რიცხვს ვამატებთ სტრინგს)
# 4. ValueError – მონაცემი სწორი ტიპისაა, მაგრამ არასწორი მნიშვნელობით (მაგ: int("abc"))
# 5. IndexError – როდესაც ლისტის ინდექსს ვადებთ ისეთ მნიშვნელობას, რაც არ არსებობს
# 6. KeyError – როდესაც dictionary-ს ვთხოვთ გასაღებს, რომელიც არ აქვს
# 7. ZeroDivisionError – როდესაც ვცდილობთ რიცხვი გავყოთ ნულზე

# ეს შეცდომები გვიჩვენებს სად არის პრობლემა და დაგვეხმარება დებაგინგის პროცესში.










name = "Giorgi"
print(name)  # გამოიტანს: Giorgi








number = 5
text = " apples"
result = str(number) + text  # რიცხვის ცვლილება სტრინგად
print(result)  # გამოიტანს: 5 apples




name = "liKa"  #
name2 = name + "4"  
print(name2)  # გამოიტანს: liKa4
